Z=(1:2:200); %观测值 
noise=randn(1,100); 
Z=Z+noise;%模拟的实际观测值

X=[0;0]; %初始状态 X=[位置;速度]
P=[1 0;0 1]; %状态协方差矩阵
F=[1 1;0 1]; %状态转移矩阵
Q=[0.0001,0;0 , 0.0001]; %状态转移协方差矩阵
H=[1,0];%传感器提供的观测矩阵
R=1;%传感器的观测噪声协方差矩阵

%% 卡尔曼滤波
figure;
hold on;

for i = 1:100 %迭代次数  
  X_ = F*X;%基于上一状态预测当前状态  X_为t时刻状态预测(这里没有控制)
  P_ = F*P*F'+Q;%更新协方差  Q系统过程的协方差
  %% 计算卡尔曼增益
  K = P_*H'/(H*P_*H'+R);
  %% 更新
  X = X_+K*(Z(i)-H*X_);% 得到当前状态的最优化估算值  增益乘以残差
  P = (eye(2)-K*H)*P_;%更新K状态的协方差
  %% 绘图
  
  plot(X(1),X(2)); 
  xlabel('位置'),ylabel('速度')
  #grid on #显示网格  
end
